app/controllers/sessions_controller.rb

    def create
        @userTwitter = UserTwitter.find_or_create_from_auth_hash(auth_hash)
---
INSERT INTO "users" ("created_at", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2016-05-19 15:38:34.093810"], ["provider", "twitter"], ["uid", "1106934434"], ["updated_at", "2016-05-19 15:38:34.093810"]]