app/controllers/tweets_controller.rb

    def create
        @tweet = Tweet.new(tweet_params)
        @tweet.userTwitter_id = current_userTwitter.id
        @tweet.save
---
INSERT INTO "tweets" ("body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["body", "heuhue"], ["created_at", "2016-05-19 15:38:40.842312"], ["updated_at", "2016-05-19 15:38:40.842312"], ["user_id", 1]]